# Data Cleaning Excercise

Write a Python / Panda Script which 'cleans' [this data set](https://github.com/edlich/eternalrepo/blob/master/DS-WAHLFACH/dsm-beuth-edl-demodata-dirty.csv).

### Create dataframe from the csv and examine the data

In [55]:
import pandas as pd
import numpy as np

url="https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/dsm-beuth-edl-demodata-dirty.csv"
df=pd.read_csv(url)


# Print columns
print("Columns: " + str(df.columns).split("[")[1].split("]")[0])
      
# Print number of rows
print("Number of Rows: " + str(len(df.index)))

# Show data frame stats
print("Data frame statistical info: ")
df.describe(include='all')

Columns: 'id', 'full_name', 'first_name', 'last_name', 'email', 'gender', 'age'
Number of Rows: 23
Data frame statistical info:

,id,full_name,first_name,last_name,email,gender,age
count,20.000000,21,21,21,20,20,21
unique,NaN,20,20,20,19,2,17
top,NaN,Eden Wace,Eden,Wace,ewacee@marriott.com,Male,16
freq,NaN,2,2,2,2,12,3
mean,10.650000,NaN,NaN,NaN,NaN,NaN,NaN
std,6.149668,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,5.750000,NaN,NaN,NaN,NaN,NaN,NaN
50%,10.500000,NaN,NaN,NaN,NaN,NaN,NaN
75%,15.250000,NaN,NaN,NaN,NaN,NaN,NaN
max,21.000000,NaN,NaN,NaN,NaN,NaN,NaN

### Remove rows that are completely empty

In [56]:
df.dropna(axis=0, how='all', inplace=True)
print("Number of Rows: " + str(len(df.index)))
print("Data frame statistical info: ")
df.describe(include='all')

Number of Rows: 21
Data frame statistical info:

,id,full_name,first_name,last_name,email,gender,age
count,20.000000,21,21,21,20,20,21
unique,NaN,20,20,20,19,2,17
top,NaN,Eden Wace,Eden,Wace,ewacee@marriott.com,Male,16
freq,NaN,2,2,2,2,12,3
mean,10.650000,NaN,NaN,NaN,NaN,NaN,NaN
std,6.149668,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,5.750000,NaN,NaN,NaN,NaN,NaN,NaN
50%,10.500000,NaN,NaN,NaN,NaN,NaN,NaN
75%,15.250000,NaN,NaN,NaN,NaN,NaN,NaN
max,21.000000,NaN,NaN,NaN,NaN,NaN,NaN

###  Remove duplicate(s)

In [57]:
df.drop_duplicates(subset=['full_name','email','gender','age'], keep='first', inplace=True)
print("Number of Rows: " + str(len(df.index)))
print("Data frame statistical info: ")
df.describe(include='all')

Number of Rows: 20
Data frame statistical info:

,id,full_name,first_name,last_name,email,gender,age
count,19.000000,20,20,20,19,19,20
unique,NaN,20,20,20,19,2,17
top,NaN,Mariel Finnigan,Mariel,Finnigan,mfinnigan0@usda.gov,Male,16
freq,NaN,1,1,1,1,12,2
mean,10.368421,NaN,NaN,NaN,NaN,NaN,NaN
std,6.184304,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,5.500000,NaN,NaN,NaN,NaN,NaN,NaN
50%,10.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,14.500000,NaN,NaN,NaN,NaN,NaN,NaN
max,21.000000,NaN,NaN,NaN,NaN,NaN,NaN

### Remove rows with invalid age (age that is not a positiv integer)

In [58]:
df = df[df.age.apply(lambda x: x.isnumeric())]
print("Number of Rows: " + str(len(df.index)))
print("Data frame statistical info: ")
df.describe(include='all')

Number of Rows: 18
Data frame statistical info:

,id,full_name,first_name,last_name,email,gender,age
count,17.000000,18,18,18,17,17,18
unique,NaN,18,18,18,17,2,15
top,NaN,Mariel Finnigan,Mariel,Finnigan,mfinnigan0@usda.gov,Male,77
freq,NaN,1,1,1,1,10,2
mean,9.882353,NaN,NaN,NaN,NaN,NaN,NaN
std,6.173354,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,5.000000,NaN,NaN,NaN,NaN,NaN,NaN
50%,9.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,14.000000,NaN,NaN,NaN,NaN,NaN,NaN
max,21.000000,NaN,NaN,NaN,NaN,NaN,NaN

### Handle missing data
We can see based on the `count` that there is 1 row missing `id`, 1 row missing `email` and 1 missing `gender`.
As `id` seems to be just incremental number, we can fix the missing value by filling it with the corresponding number. As for other data, we can not fix the missing values so we have to remove them.

#### Remove rows with empty cells in columns that are not `id`

In [59]:
df = df.dropna(subset = ['full_name', 'first_name', 'last_name', 'email','gender', 'age'])

print("Number of Rows: " + str(len(df.index)))
print("Data frame statistical info: ")
df.describe(include='all')

Number of Rows: 16
Data frame statistical info:

,id,full_name,first_name,last_name,email,gender,age
count,15.000000,16,16,16,16,16,16
unique,NaN,16,16,16,16,2,15
top,NaN,Mariel Finnigan,Mariel,Finnigan,mfinnigan0@usda.gov,Male,16
freq,NaN,1,1,1,1,10,2
mean,9.400000,NaN,NaN,NaN,NaN,NaN,NaN
std,5.779273,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,4.500000,NaN,NaN,NaN,NaN,NaN,NaN
50%,9.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,13.500000,NaN,NaN,NaN,NaN,NaN,NaN
max,20.000000,NaN,NaN,NaN,NaN,NaN,NaN

#### Update indexes with incremental number from 1

In [61]:
df['id'] = list(range(1,len(df.index)+1))
df['id']

0      1
1      2
2      3
3      4
4      5
6      6
7      7
8      8
10     9
11    10
12    11
13    12
14    13
16    14
19    15
21    16
Name: id, dtype: int64

### Final data

In [62]:
print("Number of Rows: " + str(len(df.index)))
print("Data frame statistical info: ")
df.describe(include='all')

Number of Rows: 16
Data frame statistical info:

,id,full_name,first_name,last_name,email,gender,age
count,16.000000,16,16,16,16,16,16
unique,NaN,16,16,16,16,2,15
top,NaN,Mariel Finnigan,Mariel,Finnigan,mfinnigan0@usda.gov,Male,16
freq,NaN,1,1,1,1,10,2
mean,8.500000,NaN,NaN,NaN,NaN,NaN,NaN
std,4.760952,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,4.750000,NaN,NaN,NaN,NaN,NaN,NaN
50%,8.500000,NaN,NaN,NaN,NaN,NaN,NaN
75%,12.250000,NaN,NaN,NaN,NaN,NaN,NaN
max,16.000000,NaN,NaN,NaN,NaN,NaN,NaN